import { DialogTitle, DialogContent, Typography } from "@mui/material";

const Privacy = () => {
  return (
    <>
      <DialogTitle sx={{ fontSize: "8px" }}>개인정보 처리방침</DialogTitle>
      <DialogContent dividers>
        <Typography gutterBottom sx={{ fontSize: "6px" }}>
          댕댕여지도(이하 ‘회사’라 한다)는 개인정보 보호법 제30조에 따라 정보
          주체의 개인정보를 보호하고 이와 관련한 고충을 신속하고 원활하게 처리할
          수 있도록 하기 위하여 다음과 같이 개인정보 처리지침을 수립,
          공개합니다.
        </Typography>
        <Typography gutterBottom sx={{ fontSize: "6px" }}>
          <strong>제1조 (개인정보의 처리목적)</strong>
          <br />
          회사는 다음의 목적을 위하여 개인정보를 처리합니다. 처리하고 있는
          개인정보는 다음의 목적 이외의 용도로는 이용되지 않으며, 이용 목적이
          변경되는 경우에는 개인정보보호법 제18조에 따라 별도의 동의를 받는 등
          필요한 조치를 이행할 예정입니다.
          <br />
          1. 홈페이지 회원 가입 및 관리
          <br />
          회원 가입 의사 확인, 회원제 서비스 제공에 따른 본인 식별․인증,
          회원자격 유지․관리, 제한적 본인확인제 시행에 따른 본인확인, 서비스
          부정 이용 방지, 만 14세 미만 아동의 개인정보처리 시 법정대리인의 동의
          여부 확인, 각종 고지․통지, 고충 처리 등을 목적으로 개인정보를
          처리합니다.
          <br />
          2. 재화 또는 서비스 제공
          <br />
          물품 배송, 서비스 제공, 계약서 및 청구서 발송, 콘텐츠 제공, 맞춤서비스
          제공, 본인인증, 연령인증, 요금 결제 및 정산, 채권추심 등을 목적으로
          개인정보를 처리합니다.
          <br />
          3. 고충 처리
          <br />
          민원인의 신원 확인, 민원사항 확인, 사실조사를 위한 연락․통지, 처리
          결과 통보 등의 목적으로 개인정보를 처리합니다.
        </Typography>
        <Typography gutterBottom sx={{ fontSize: "6px" }}>
          <strong>제2조 (개인정보의 처리 및 보유기간)</strong>
          <br />
          ① 회사는 법령에 따른 개인정보 보유, 이용 기간 또는 정보주체로부터
          개인정보를 수집 시에 동의 받은 개인정보 보유, 이용 기간 내에서
          개인정보를 처리, 보유합니다.
          <br />
          ② 각각의 개인정보 처리 및 보유 기간은 다음과 같습니다.
          <br />
          1. 홈페이지 회원 가입 및 관리 : 사업자/단체 홈페이지 탈퇴 시까지 다만,
          다음의 사유에 해당하는 경우에는 해당 사유 종료 시까지
          <br />1{")"} 관계 법령 위반에 따른 수사, 조사 등이 진행 중인 경우에는
          해당 수사, 조사 종료 시까지
          <br />2{")"} 홈페이지 이용에 따른 채권 및 채무관계 잔존 시에는 해당
          채권, 채무 관계 정산 시까지
        </Typography>
        <Typography gutterBottom sx={{ fontSize: "6px" }}>
          <strong>제3조 (개인정보의 제3자 제공)</strong>
          <br />
          ① 회사는 정보주체의 개인정보를 제1조(개인정보의 처리목적)에서 명시한
          범위 내에서만 처리하며, 정보주체의 동의, 법률의 특별한 규정 등
          개인정보 보호법 제17조에 해당하는 경우에만 개인정보를 제3자에게
          제공합니다.
          <br />
          ② 회사는 다음과 같이 개인정보를 제3자에게 제공하고 있습니다.
          <br />- 개인정보를 제공받는 자 : {"<예)"} (주) OOO 카드{">"}
          <br />- 제공받는 자의 개인정보 이용목적 : {"<예)"} 이벤트 공동개최 등
          업무제휴 및 제휴 신용카드 발급{">"}
          <br />- 제공하는 개인정보 항목 : {"<예)"} 성명, 주소, 전화번호,
          이메일주소, 카드결제계좌정보{">"}
          <br />- 제공받는 자의 보유, 이용기간 :{" <예)"} 신용카드 발급계약에
          따른 거래기간동안{">"}
        </Typography>
        <Typography gutterBottom sx={{ fontSize: "6px" }}>
          <strong>제4조(개인정보처리의 위탁)</strong>
          <br />
          ① 회사는 원활한 개인정보 업무처리를 위하여 다음과 같이 개인정보
          처리업무를 위탁하고 있습니다.
          <br />
          - 위탁받는 자 (수탁자) : 댕댕여지도
          <br />- 위탁하는 업무의 내용 : 쇼핑몰 호스팅 서비스의 시스템 제공,
          모바일 앱 서비스, 마케팅 서비스 및 부가, 제휴서비스 제공 및 알림톡,
          친구톡, 문자메시지 발송대행 서비스 등
        </Typography>
        <Typography gutterBottom sx={{ fontSize: "6px" }}>
          <strong>제5조(이용자 및 법정대리인의 권리와 그 행사 방법)</strong>
          <br />
          ① 정보주체는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련
          권리를 행사할 수 있습니다.
          <br />
          1. 개인정보 열람 요구
          <br />
          2. 오류 등이 있을 경우 정정 요구
          <br />
          3. 삭제요구
          <br />
          4. 처리정지 요구
        </Typography>
        <Typography gutterBottom sx={{ fontSize: "6px" }}>
          <strong>제6조(개인정보 처리방침 시행 및 변경)</strong>
          <br />이 개인정보 처리방침은 2024. 09. 03부터 적용됩니다.
        </Typography>
      </DialogContent>
    </>
  );
};

export default Privacy;
